In [3]:
import pandas as pd
import numpy as np

In [4]:
s = pd.Series([0.2, 0.4, 0.8, 1.5])

In [5]:
s

0    0.2
1    0.4
2    0.8
3    1.5
dtype: float64

In [6]:
s[0]

0.2

In [19]:
s[0:2]

0    0.2
1    0.4
dtype: float64

In [20]:
s.index

RangeIndex(start=0, stop=4, step=1)

In [21]:
s.values

array([0.2, 0.4, 0.8, 1.5])

In [24]:
s1 = pd.Series([1, 2, 3, 4], index=["un", "deux", "trois", "quatre"])

In [25]:
s1["trois"]

3

In [28]:
s1[["trois", "quatre"]]  # correspond au SELECT

trois     3
quatre    4
dtype: int64

In [29]:
s2 = pd.Series({"iris": "bleu", "tournesol": "rouge", "rose": "rose"})

In [30]:
s2

iris          bleu
tournesol    rouge
rose          rose
dtype: object

In [31]:
s1

un        1
deux      2
trois     3
quatre    4
dtype: int64

In [33]:
s1[s1 < 3]  # équivaut au WHERE en SQL

un      1
deux    2
dtype: int64

In [34]:
s1 < 3

un         True
deux       True
trois     False
quatre    False
dtype: bool

In [35]:
s1[["un", "deux", "trois"]][s1 < 2]

un    1
dtype: int64

In [36]:
s1 * 2

un        2
deux      4
trois     6
quatre    8
dtype: int64

In [38]:
np.exp(s1)

un         2.718282
deux       7.389056
trois     20.085537
quatre    54.598150
dtype: float64

In [39]:
"dix" in s1

False

In [40]:
"trois" in s1

True

In [44]:
s1

un        1
deux      2
trois     3
quatre    4
dtype: int64

In [53]:
s3

un       5
deux     4
dix     10
dtype: int64

In [54]:
s3 = pd.Series({"un": 5, "deux": 0, "dix": 10})

In [55]:
s4 = s1 + s3

In [56]:
s4

deux      2.0
dix       NaN
quatre    NaN
trois     NaN
un        6.0
dtype: float64

In [ ]:
# NaN ça veut dire "Not A Number"

In [50]:
s4[s4.isnull()]

dix      NaN
quatre   NaN
trois    NaN
dtype: float64

In [51]:
s4[s4.notnull()]

deux    6.0
un      6.0
dtype: float64

In [85]:
data = {
    "city": ["Paris", "Berlin", "Marseille", "Rome"],
    "population": [3000000, 3500000, 1500000, 2800000],
    "area": [105000, 819000, 240000, 1285000],
}

In [86]:
df = pd.DataFrame(data)

In [60]:
df

        city  population
0      Paris     3000000
1     Berlin     3500000
2  Marseille     1500000
3       Rome     2800000

In [61]:
df["city"]

0        Paris
1       Berlin
2    Marseille
3         Rome
Name: city, dtype: object

In [62]:
type(df)

pandas.core.frame.DataFrame

In [63]:
type(df["city"])

pandas.core.series.Series

In [69]:
df

        city  population
0      Paris     3000000
1     Berlin     3500000
2  Marseille     1500000
3       Rome     2800000

In [68]:
df.dtypes

city          object
population     int64
dtype: object

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   city        4 non-null      object
 1   population  4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

In [73]:
df.describe()

         population
count  4.000000e+00
mean   2.700000e+06
std    8.524475e+05
min    1.500000e+06
25%    2.475000e+06
50%    2.900000e+06
75%    3.125000e+06
max    3.500000e+06

In [74]:
_ _ _ _ _ _ _ _

512

In [76]:
_ _ _ _ 0 1 _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ ... _ _ _ _

36893488147419103232

In [ ]:
"2020-01-01" > timestamp nombre de secondes écoulées depuis "1970-01-01"

2^32

In [80]:
df.values

array([['Paris', 3000000],
       ['Berlin', 3500000],
       ['Marseille', 1500000],
       ['Rome', 2800000]], dtype=object)

In [81]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [82]:
df.columns

Index(['city', 'population'], dtype='object')

In [89]:
df

        city  population     area
0      Paris     3000000   105000
1     Berlin     3500000   819000
2  Marseille     1500000   240000
3       Rome     2800000  1285000

In [93]:
df["density"] = df["population"] / df["area"]

In [94]:
df

        city  population     area  population_per_squaremeter    density
0      Paris     3000000   105000                   28.571429  28.571429
1     Berlin     3500000   819000                    4.273504   4.273504
2  Marseille     1500000   240000                    6.250000   6.250000
3       Rome     2800000  1285000                    2.178988   2.178988

In [95]:
df[["city", "area", "population", "density"]]

        city     area  population    density
0      Paris   105000     3000000  28.571429
1     Berlin   819000     3500000   4.273504
2  Marseille   240000     1500000   6.250000
3       Rome  1285000     2800000   2.178988

In [103]:
df[df["density"] > 5][["city", "density"]]

        city    density
0      Paris  28.571429
2  Marseille   6.250000

In [104]:
df

        city  population     area  population_per_squaremeter    density
0      Paris     3000000   105000                   28.571429  28.571429
1     Berlin     3500000   819000                    4.273504   4.273504
2  Marseille     1500000   240000                    6.250000   6.250000
3       Rome     2800000  1285000                    2.178988   2.178988

In [107]:
df.set_index("city", inplace=True)  # ou df = df.set_index ...

In [117]:
df

           population     area  population_per_squaremeter    density
city
Paris         3000000   105000                   28.571429  28.571429
Berlin        3500000   819000                    4.273504   4.273504
Marseille     1500000   240000                    6.250000   6.250000
Rome          2800000  1285000                    2.178988   2.178988

In [ ]:
# pour récuperer la donnée par index
df.iloc et df.loc

In [122]:
df.iloc[0,0:3]

population                    3.000000e+06
area                          1.050000e+05
population_per_squaremeter    2.857143e+01
Name: Paris, dtype: float64

In [123]:
df.iloc[:]

           population     area  population_per_squaremeter
city
Paris         3000000   105000                   28.571429
Berlin        3500000   819000                    4.273504
Marseille     1500000   240000                    6.250000
Rome          2800000  1285000                    2.178988

In [125]:
df.loc[["Paris", "Marseille"], "population"]

city
Paris        3000000
Marseille    1500000
Name: population, dtype: int64